<a href="https://colab.research.google.com/github/fedhere/PUS2020_FBianco/blob/master/classdemos/testDiffSheets.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
from google.colab import drive
import pandas as pd

In [ ]:
drive.mount("/content/drive")

Go to this URL in a browser: https://accounts.google.com/o/oauth2/auth?client_id=947318989803-6bn6qk8qdgf4n4g3pfee6491hc0brc4i.apps.googleusercontent.com&redirect_uri=urn%3aietf%3awg%3aoauth%3a2.0%3aoob&scope=email%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdocs.test%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive.photos.readonly%20https%3a%2f%2fwww.googleapis.com%2fauth%2fpeopleapi.readonly&response_type=code

Enter your authorization code:
··········
Mounted at /content/drive

In [ ]:
ls

drive/  sample_data/

In [ ]:
cd drive

/content/drive

In [ ]:
ls

'My Drive'/  'Shared drives'/

In [ ]:
cd Shared\ drives/PUS2020

/content/drive/Shared drives/PUS2020

In [ ]:
ls data

arrest_data_daily_by_zip.csv  MapPLUTO.shp.xml  MNMapPLUTO.shp.xml
MapPLUTO.cpg                  MapPLUTO.shx      MNMapPLUTO.shx
MapPLUTO.dbf                  MNMapPLUTO.dbf    PLUTODD20v5.pdf
MapPLUTO.prj                  MNMapPLUTO.prj    PlutoReadme20v5.pdf
MapPLUTO.sbn                  MNMapPLUTO.sbn    Varnamesnlabels_m2ihip_R.xlsx
MapPLUTO.sbx                  MNMapPLUTO.sbx    Varnamesnlabels_m2ihip.xlsx
MapPLUTO.shp                  MNMapPLUTO.shp

In [ ]:
df1 = pd.read_excel("data/Varnamesnlabels_m2ihip_R.xlsx")
df1

              varname                                           varlabel
0                  id                                                NaN
1         m2StartDate                                         Start Date
2           m2EndDate                                           End Date
3      m2RecordedDate                                      Recorded Date
4               m2hid                  Enter House ID Number here (1-8):
..                ...                                                ...
217     m2severetotal  Addiction Severity Total Composite: Higher sco...
218          m2currod  In the past month, did you experience an overd...
219  m2currodfreq_str        Number of times you experienced an overdose
220     m2openend_str  Is there anything else you would like us to know?
221  m2employoth_flag     Participant specified other employment status.

[222 rows x 2 columns]

In [ ]:
df2 = pd.read_excel("data/Varnamesnlabels_m2ihip.xlsx")
df2

              varname                                           varlabel
0                  id                                                NaN
1               m2hid                  Enter House ID Number here (1-8):
2               m2ooh                                                NaN
3               m2age  How old are you? Please enter your current age...
4            m2agecat                          Age, categorical variable
..                ...                                                ...
214     m2severetotal  Addiction Severity Total Composite: Higher sco...
215          m2currod  In the past month, did you experience an overd...
216  m2currodfreq_str        Number of times you experienced an overdose
217     m2openend_str  Is there anything else you would like us to know?
218  m2employoth_flag     Participant specified other employment status.

[219 rows x 2 columns]

In [ ]:
merged = df2.merge(df1, on="varname", how="outer", indicator=True)
merged

              varname  ...      _merge
0                  id  ...        both
1               m2hid  ...        both
2               m2ooh  ...        both
3               m2age  ...        both
4            m2agecat  ...        both
..                ...  ...         ...
217     m2openend_str  ...        both
218  m2employoth_flag  ...        both
219       m2StartDate  ...  right_only
220         m2EndDate  ...  right_only
221    m2RecordedDate  ...  right_only

[222 rows x 4 columns]

In [ ]:
merged[merged._merge == 'right_only']

            varname varlabel_x     varlabel_y      _merge
219     m2StartDate        NaN     Start Date  right_only
220       m2EndDate        NaN       End Date  right_only
221  m2RecordedDate        NaN  Recorded Date  right_only

In [ ]:
merged.varlabel_x == merged.varlabel_y

0      False
1       True
2      False
3       True
4       True
       ...
217     True
218     True
219    False
220    False
221    False
Length: 222, dtype: bool

In [ ]:
merged[~(merged.varlabel_x == merged.varlabel_y)]

              varname  ...      _merge
0                  id  ...        both
2               m2ooh  ...        both
184  m2currMAToth_str  ...        both
219       m2StartDate  ...  right_only
220         m2EndDate  ...  right_only
221    m2RecordedDate  ...  right_only

[6 rows x 4 columns]